Examples/RegionSolvers/icoStructChannel/0.org/solid/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            groovyTractionDisplacement;
        //        type            tractionDisplacement;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
        tractionExpression "0.1*min(10*time(),1)*mappedInternal(U)";
        pressureExpression "min(10*time(),1)*mapped(p)";
     }
    top
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    inlet
    {
        //        type            tractionDisplacement;
        type fixedValue;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }

    outlet
    {
        //        type            tractionDisplacement;
        type fixedValue;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
